hw1.html
<!doctype html>
<html lang="en">
<head>
<title>Additional Problems</title>
<!-- 2018-08-19 Sun 20:32 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="agnishom">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Additional Problems</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Problem 7</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Call a formula using \(\lor\), \(\land\) and \(\neg\) to be in negative normal form if negations are only applied directly on propositional atoms. For example, \(p \land \neg q\) is in negative normal form, but \(\neg(p \land q)\) is not.
</li>

<li>Mimic the inductive definition of well formed formulae \(\Phi\) in class to give a formal definition of formulae in negative normal form. Do this by first defining literals which are just propositions or negations thereof, and then extending the language to contain formulae involving \(\lor\) and \(\land\).
</li>

<li>Show that you can convert a well formed formula comprising \(\lor\), \(\land\) and \(\neg\) to a negative normal form so that they "are the same" according to your defintion in problem 2. What is the complexity of this conversion?
</li>

<li>Given a formula \(\alpha\) in negative normal form and a valuation \(v\). Define \(pos(v, \alpha)\) to be the set of literals which are evaluated to true under \(v\). Suppose \(\alpha\) and \(\beta\) are two formulae such that \(pos(v, \alpha) \subseteq pos(v, \beta)\). Show that \(v \models \alpha \implies v \models \beta\). 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Problem 8</h2>
<div class="outline-text-2" id="text-2">
<p>
We'll consider a proof system of strings involving strings formed with the letters <code>M</code>, <code>I</code> and <code>U</code>.
</p>

<ul class="org-ul">
<li>The system contains four inference rules
</li>
</ul>

<p>
\[ \begin{matrix}
\dfrac{x\texttt{I}}{x\texttt{IU}} & \dfrac{\texttt{M}x}{\texttt{M}xx}\\
& \\
\dfrac{x\texttt{III}y}{x\texttt{U}y} & \dfrac{x\texttt{UU}y}{xy}
\end{matrix} \]
</p>

<ul class="org-ul">
<li>and one axiom
</li>
</ul>

<p>
\[ \dfrac{}{\texttt{MI}} \]
</p>

<p>
The problem is to figure out if \(\texttt{MU}\) is a theorem of this system.
</p>

<p>
(Clarification: \(x\) and \(y\) are any (possibly empty) words in the alphabet <code>M</code>, <code>I</code> and <code>U</code>. The inference rules must be applied to a word as a whole and not a subword.)
</p>

<hr >

<p>
To illustrate an example, \(\texttt{MIUIU}\) is a theorem in this system, because we have the following proof:
</p>

<p>
\[\texttt{MI} \xrightarrow[(1)]{} \texttt{MIU} \xrightarrow[(2)]{} \texttt{MIUIU}\] 
</p>

<p>
where the numbers on the arrows are the numbers of the inference rules used.
</p>

<p>
The above puzzle appears in <a href="https://en.wikipedia.org/wiki/G%C3%B6del,_Escher,_Bach">Godel, Escher, Bach</a> where the author uses it to contrast the philosophical distinction between syntactic and semantic levels of interpretations. To quote wikipedia:
</p>

<blockquote>
<p>

</p>

<p>
It also demonstrates the contrast between interpretation on the "syntactic" level of symbols and on the "semantic" level of meanings. On the syntactic level, there is no knowledge of the MU puzzle's insolubility. The system does not refer to anything: it is simply a game involving meaningless strings. Working within the system, an algorithm could successively generate every valid string of symbols in an attempt to generate MU, and though it would never succeed, it would search forever, never deducing that the quest was futile. For a human player however, after a number of attempts, one soon begins to suspect that the puzzle may be impossible. One then "jumps out of the system" and starts to reason about the system, rather than working within it. Eventually, one realises that the system is in some way about divisibility by three. This is the "semantic" level of the system — a level of meaning that the system naturally attains. On this level, the MU puzzle can be seen to be impossible. 
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Problem 9</h2>
<div class="outline-text-2" id="text-3">
<p>
Let \(X\) be a set. \(\mathcal{F}\), a subset of the powerset of \(X\) is said to be a <i>field of sets</i> over \(X\) if \(\mathcal{F}\) is closed under complementation, finite unions and intersection. 
</p>

<p>
Given a field of sets over some set \(X\), we define an alternate semantics for propositional logic as follows:
</p>

<ul class="org-ul">
<li>A valuation \(v : PV \to \mathcal{F}\) is a function that assigns to each propositional atom an element of \(\mathcal{F}\)
</li>
<li>We extend \(v\) to \(\hat{v} : \Phi \to \mathcal{F}\) as follows:
<ul class="org-ul">
<li>\(\hat{v}(p) = v(p)\) where \(p \in PV\)
</li>
<li>\(\hat{v}({\neg \varphi}) = X \setminus \hat{v}({\varphi})\)
</li>
<li>\(\hat{v}({\varphi \lor \psi}) = \hat{v}(\varphi) \cup \hat{v}(\psi)\)
</li>
<li>\(\hat{v}({\varphi \land \psi}) = \hat{v}(\varphi) \cap \hat{v}(\psi)\)
</li>
</ul>
</li>
</ul>

<p>
We say that \(v \models \varphi\) iff \(\hat{v}(\varphi) = X\). As usual, we say \(\varphi\) is valid iff \(v \models \varphi\) for all valuations \(v\).
</p>

<p>
Show that the usual semantics is equivalent to this semantics in the sense that \(\varphi\) is valid under the usual semantics if and only if \(\varphi\) is valid under this semantics.
</p>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Problem 7</a></li>
<li><a href="#sec-2">2. Problem 8</a></li>
<li><a href="#sec-3">3. Problem 9</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: agnishom</p>
<p class="date">Created: 2018-08-19 Sun 20:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.13)</p>
</div>
</footer>
</body>
</html>
